package cn.doitedu.exercise

class X03_关联综合练习 {
  def main(args: Array[String]): Unit = {

    /**
     * 表1（订单汇总表）：订单id，用户id，订单总额
     * 1,u01,20
     * 2,u01,15
     * 3,u02,30
     * 4,u03,40
     */

    /**
     * 表2（订单详情表）：订单id，商品id，购买件数，商品单价
     * 1,p01,1,10.0
     * 1,p03,2,30.0
     * 2,p04,2,40.0
     * 3,p02,2,20.0
     * 4,p01,1,10.0
     * 4,p05,2,50.0
     */


    /**
     * 表3（商品信息表）：商品id，品类id，品牌id
     * p01,c01,b01
     * p02,c01,b01
     * p03,c02,b03
     * p04,c02,b01
     * p05,c01,b02
     */


    /**
     * 统计如下报表：
     *    1. 每个品类的订单总额（按原价）
     *    2. 每个用户的订单总额（按原价）
     *    3. 每个品牌的订单总额（按原价）
     *    4. 每个订单的优惠总额
     */

  }
}
